# reading and sorting the cities data

In [3]:
import pandas as pd

data = pd.read_excel(r"C:\Users\haris\OneDrive\Desktop\Guvi\Projects\Amazon_Sales_Analysis\dataset\cities_list.xls")
print(data.head())

  S.No Name of City        State                                  Type  \
0    1       Mumbai  Maharashtra   Municipal Corporation / Corporation
1    2        Delhi        Delhi   Municipal Corporation / Corporation
2    3    Bengaluru    Karnataka   Municipal Corporation / Corporation
3    4    Ahmedabad      Gujarat  Municipal Corporation / Corporation.
4    5    Hyderabad    Telangana   Municipal Corporation / Corporation

   Population (2011) Population class
0         13597924.0          Class I
1         11007835.0          Class I
2          8425970.0          Class I
3          7208200.0          Class I
4          6809970.0          Class I

In [4]:
data.columns

Index(['S.No', 'Name of City', 'State', 'Type', 'Population (2011)',
       'Population class'],
      dtype='object')

In [5]:
data.drop(columns=['S.No', 'Type', 'Population (2011)', "Population class"], inplace=True)

In [6]:
data.head()

  Name of City        State
0       Mumbai  Maharashtra
1        Delhi        Delhi
2    Bengaluru    Karnataka
3    Ahmedabad      Gujarat
4    Hyderabad    Telangana

In [8]:
data = data.sort_values(by=['State', 'Name of City'])

In [9]:
data.head()

    Name of City                        State
333   Port Blair  Andaman and Nicobar Islands
201        Adoni               Andhra Pradesh
584   Amalapuram               Andhra Pradesh
381   Anakapalle               Andhra Pradesh
135    Anantapur               Andhra Pradesh

In [10]:
data.to_csv(r"C:\Users\haris\OneDrive\Desktop\Guvi\Projects\Amazon_Sales_Analysis\dataset\cities_list.csv", index=False)